queryFrequency: 5h
queryPeriod: 5h
triggerOperator: GreaterThan
triggerThreshold: 0
eventGroupingSettings:
  aggregationKind: AlertPerResult
severity: Medium
query: |
  OfficeActivity
  | where Operation == "New-InboxRule"
  | extend AccountCustomIdentity = UserId,IPCustomIdentity = ClientIP, ForwardedEmail = tostring(parse_json(Parameters)[2].Value), RuleName = tostring(parse_json(Parameters)[4].Value)
suppressionDuration: 5h
suppressionEnabled: false
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: AccountCustomIdentity
- entityType: SubmissionMail
  fieldMappings:
  - identifier: Submitter
    columnName: RuleName
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: IPCustomEntity
displayName: Email Redirection by user
enabled: true
description: This alert generates a Incident when a redirection rule is created on a user mailbox
tactics:
- Exfiltration
kind: Scheduled
createIncident: true
groupingConfiguration:
  enabled: false
  reopenClosedIncident: false
  lookbackDuration: 5h
  entitiesMatchingMethod: All
  groupByEntities: []
playbookName: ""

